In [1]:
import pandas as pd
import numpy as np

In [29]:
mydict = {
    "A" : [1,2,np.nan],
    "B" : [4,np.nan,np.nan],
    "C" : [6,7,8]
}

In [30]:
df = pd.DataFrame(mydict)

In [31]:
df

     A    B  C
0  1.0  4.0  6
1  2.0  NaN  7
2  NaN  NaN  8

In [32]:
df.isnull()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [5]:
df.dropna()

     A    B  C
0  1.0  4.0  6

In [6]:
df.dropna(axis=1)

   C
0  6
1  7
2  8

In [7]:
df.dropna(thresh=2)

     A    B  C
0  1.0  4.0  6
1  2.0  NaN  7

In [8]:
df.fillna('cnq')

     A    B  C
0  1.0  4.0  6
1  2.0  cnq  7
2  cnq  cnq  8

In [9]:
df['A'].fillna('cnq')

0    1.0
1    2.0
2    cnq
Name: A, dtype: object

In [10]:
data = {
    'employees' : ['Ramesh','suresh','pk','Ramesh','suresh'],
    'salary' : [5000,2000,3000,1000,6000]
}
df = pd.DataFrame(data)

In [11]:
pd

In [12]:
df

  employees  salary
0    Ramesh    5000
1    suresh    2000
2        pk    3000
3    Ramesh    1000
4    suresh    6000

In [13]:
emp = df.groupby('employees')

In [14]:
emp.sum()

           salary
employees
Ramesh       6000
pk           3000
suresh       8000

In [15]:
emp.max()

           salary
employees
Ramesh       5000
pk           3000
suresh       6000

In [16]:
emp.count()

           salary
employees
Ramesh          2
pk              1
suresh          2

In [17]:
emp.describe()

          salary
           count    mean          std     min     25%     50%     75%     max
employees
Ramesh       2.0  3000.0  2828.427125  1000.0  2000.0  3000.0  4000.0  5000.0
pk           1.0  3000.0          NaN  3000.0  3000.0  3000.0  3000.0  3000.0
suresh       2.0  4000.0  2828.427125  2000.0  3000.0  4000.0  5000.0  6000.0

In [33]:
df = pd.DataFrame({
    'A' : [1,2,3,4],
    'B' : [44,55,66,44],
    'C' : ['abc','def','ghi','xyz']
})

In [34]:
df

   A   B    C
0  1  44  abc
1  2  55  def
2  3  66  ghi
3  4  44  xyz

In [20]:
df['B'].unique()

array([44, 55, 66], dtype=int64)

In [21]:
df['B'].nunique()

3

In [22]:
df["B"].value_counts()

44    2
55    1
66    1
Name: B, dtype: int64

In [23]:
df["A"].apply(lambda x : x*x)

0     1
1     4
2     9
3    16
Name: A, dtype: int64

In [24]:
df["B"].sort_values()

0    44
3    44
1    55
2    66
Name: B, dtype: int64

In [25]:
df.sort_values("B")

   A   B    C
0  1  44  abc
3  4  44  xyz
1  2  55  def
2  3  66  ghi

In [26]:
df.isnull()

       A      B      C
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False